//----------------------------------------------------------------------------//
#include <stdbool.h>
#include <stdio.h>
#include "common_types.h"
//----------------------------------------------------------------------------//
struct USB_Driver_t{
	void (*uartInit)(void);						//Инициализация UART
	bool (*getTransmissionCompleteFlag)(void);	//Получить флаг завершенной передачи
};
extern const struct USB_Driver_t USB_Driver;
//----------------------------------------------------------------------------//
void sysLogPut(void);
//----------------------------------------------------------------------------//
#define SYS_LOG_BUFF_SIZE		256
//----------------------------------------------------------------------------//
extern char str_tmp[SYS_LOG_BUFF_SIZE];
//----------------------------------------------------------------------------//
#define _SYSLOG_(...)										\
do{															\
	snprintf(str_tmp, SYS_LOG_BUFF_SIZE, __VA_ARGS__);	\
	sysLogPut();											\
}while(0)
//----------------------------------------------------------------------------//
