/*
  * Copyright (c) 2004-2005, Swedish Institute of Computer Science.
  * Все права зарезервированы. *
  * Повторное распространение, использование в исходном и двоичном виде,
  * с модификацией или без - разрешается, если выполняются следующие
  * условия:
  * 1. Распространение исходного кода должно сохранить вышеуказанную пометку
  *    копирайта, этот список условий и следующую правовую оговорку.
  * 2. Распространение исходного кода должно сохранить вышеуказанную пометку
  *    копирайта, этот список условий и следующую правовую оговорку в
  *    документации и/или других материалах, которые будут предоставлены
  *    вместе с распространяемыми материалами.
  * 3. Имя автора не может использоваться, чтобы подтвердить или продвинуть
  *    продукты, написанные с использованием этого программного обеспечения
  *    без специального на то разрешения.
  *
  * ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ ``КАК ЕСТЬ'', БЕЗ
  * КАКОЙ-ЛИБО ЛЮБОЙ РАСШИРЕННОЙ ИЛИ ПОДРАЗУМЕВАЕМОЙ ГАРАНТИИ, ВКЛЮЧАЯ,
  * НО НЕ ОГРАНИЧИВАЯСЬ ЭТИМ, ГАРАНТИИ ВЫСОКОГО СПРОСА И ПРИГОДНОСТИ
  * ДЛЯ КОНКРЕТНОЙ ЦЕЛИ. АВТОР НИ ПРИ КАКИХ УСЛОВИЯХ НЕ ОТВЕТСТВЕНЕН
  * ЗА ЛЮБЫЕ УБЫТКИ - ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ОБРАЗЦОВЫЕ
  * ИЛИ ПОСЛЕДОВАТЕЛЬНЫЕ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ЭТИМ, ТРЕБОВАНИЯ
  * ЗАМЕНЫ ТОВАРА ИЛИ СЕРВИСА; ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ВЫГОДЫ;
  * ИЛИ ПРЕКРАЩЕНИЕ БИЗНЕСА), ОДНАКО ВЫЗВАННЫЕ ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ,
  * ЛИБО В КОНТРАКТЕ, ПРЯМОЙ ОТВЕТСТВЕННОСТИ, ЛИБО В НАРУШЕНИИ ЗАКОННЫХ ПРАВ
  * (ВКЛЮЧАЯ ТАК ИЛИ ИНАЧЕ НЕБРЕЖНОСТЬ), ВОЗНИКАЮЩИЕ ВСЕГДА ИЗ ИСПОЛЬЗОВАНИЯ
  * ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО ПРЕДУПРЕЖДЕНИЕ О ВОЗМОЖНОСТИ
  * ТАКОГО ПОВРЕЖДЕНИЯ.
  *
  * Этот файл является частью стека uIP TCP/IP.
  *
  * Author: Adam Dunkels <adam@sics.se>
  *
  * $Id: lc-switch.h,v 1.2 2006/06/12 08:00:30 adam Exp $
  */
 
 /**
  * \addtogroup lc
  * @{
  */
 
 /**
  * \file
  * Реализация локальных продолжителей (local continuations, LC) на основе
  * оператора switch()
  * \author Adam Dunkels <adam@sics.se>
  *
  * Эта реализация LC использует оператор switch() языка C для возобновления
  * выполнения функции в некоторой точке её тела. Реализация основана на
  * том факте, что опеатор switch() способен сделать переход напрямую 
  * в тело структуры управления, такой как операторы if() или while().
  *
  * Эта реализация использоваала в основном сопрограммы от Simon Tatham,
  * реализованные на C:
  * http://www.chiark.greenend.org.uk/~sgtatham/coroutines.html
  */
 
 #ifndef __LC_SWITCH_H__
 #define __LC_SWTICH_H__
 
 /* ВНИМАНИЕ! Реализация LC с использование switch() не будет работать, если
    LC_SET() будет выполнен в другом операторе switch()! */
 
 /** \hideinitializer */
 typedef unsigned short lc_t;
 
 #define LC_INIT(s) s = 0;
 
 #define LC_RESUME(s) switch(s) { case 0:
 
 #define LC_SET(s) s = __LINE__; case __LINE__:
 
 #define LC_END(s) }
 
 #endif /* __LC_SWITCH_H__ */
 
 /** @} */
