/*
  * Copyright (c) 2004-2005, Swedish Institute of Computer Science.
  * Все права зарезервированы. *
  * Повторное распространение, использование в исходном и двоичном виде,
  * с модификацией или без - разрешается, если выполняются следующие
  * условия:
  * 1. Распространение исходного кода должно сохранить вышеуказанную пометку
  *    копирайта, этот список условий и следующую правовую оговорку.
  * 2. Распространение исходного кода должно сохранить вышеуказанную пометку
  *    копирайта, этот список условий и следующую правовую оговорку в
  *    документации и/или других материалах, которые будут предоставлены
  *    вместе с распространяемыми материалами.
  * 3. Имя автора не может использоваться, чтобы подтвердить или продвинуть
  *    продукты, написанные с использованием этого программного обеспечения
  *    без специального на то разрешения.
  *
  * ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ ``КАК ЕСТЬ'', БЕЗ
  * КАКОЙ-ЛИБО ЛЮБОЙ РАСШИРЕННОЙ ИЛИ ПОДРАЗУМЕВАЕМОЙ ГАРАНТИИ, ВКЛЮЧАЯ,
  * НО НЕ ОГРАНИЧИВАЯСЬ ЭТИМ, ГАРАНТИИ ВЫСОКОГО СПРОСА И ПРИГОДНОСТИ
  * ДЛЯ КОНКРЕТНОЙ ЦЕЛИ. АВТОР НИ ПРИ КАКИХ УСЛОВИЯХ НЕ ОТВЕТСТВЕНЕН
  * ЗА ЛЮБЫЕ УБЫТКИ - ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ, ОБРАЗЦОВЫЕ
  * ИЛИ ПОСЛЕДОВАТЕЛЬНЫЕ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ЭТИМ, ТРЕБОВАНИЯ
  * ЗАМЕНЫ ТОВАРА ИЛИ СЕРВИСА; ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ВЫГОДЫ;
  * ИЛИ ПРЕКРАЩЕНИЕ БИЗНЕСА), ОДНАКО ВЫЗВАННЫЕ ПО ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ,
  * ЛИБО В КОНТРАКТЕ, ПРЯМОЙ ОТВЕТСТВЕННОСТИ, ЛИБО В НАРУШЕНИИ ЗАКОННЫХ ПРАВ
  * (ВКЛЮЧАЯ ТАК ИЛИ ИНАЧЕ НЕБРЕЖНОСТЬ), ВОЗНИКАЮЩИЕ ВСЕГДА ИЗ ИСПОЛЬЗОВАНИЯ
  * ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ БЫЛО ПРЕДУПРЕЖДЕНИЕ О ВОЗМОЖНОСТИ
  * ТАКОГО ПОВРЕЖДЕНИЯ.
  *
  * Этот файл является частью стека uIP TCP/IP.
  *
  * Author: Adam Dunkels <adam@sics.se>
  *
  * $Id: lc.h,v 1.2 2006/06/12 08:00:30 adam Exp $
  */
 
 /**
  * \addtogroup pt
  * @{
  */
 
 /**
  * \defgroup lc Локальные продолжения (Local continuations, далее LC)
  * @{
  *
  * LC являются базой для реализации протопотоков. LC может быть <i>set</i> 
  * (установлено) в отдельной функции в захват состояния функции. После того,
  * как LC было установлено, оно может быть <i>resumed</i> (возобновлено)
  * для восстановления состояния функции в точке, где было установлено LC.
  *
  *
  */
 
 /**
  * \file lc.h
  * Local continuations (локальные продолжения, LC)
  * \author
  * Adam Dunkels <adam@sics.se>
  *
  */
 
 #ifdef DOXYGEN
 /**
  * Инициализирует LC.
  *
  * Эта операция инициализирует LC, так что сбрасывается любое ранее
  * установленное состояние LC.
  *
  * \hideinitializer
  */
 #define LC_INIT(lc)
 
 /**
  * Установка LC.
  *
  * Операция set (установка) сохраняет состояние функции в точке, где
  * операция установки была выполнена. Операция set сохраняет состояние
  * функции не очень глубоко, так что это сохранение <b>не</b> включает
  * переменные, передаваемые через стек (call-stack) или локальные 
  * (автоматические) переменные. Сохраняется только программный счетчик
  * и регистры CPU, которые должны быть сохранены.
  *
  * \hideinitializer
  */
 #define LC_SET(lc)
 
 /**
  * Возобновление LC.
  *
  * Операция resume (возобновление) восстанавливает выполнение ранее
  * установленного LC, так что выполнение функции продолжается с места,
  * где LC было установлено. Если LC не было ранее установлено, то 
  * resume ничего не делает.
  *
  * \hideinitializer
  */
 #define LC_RESUME(lc)
 
 /**
  * Пометка места окончания использования LC.
  *
  * Операция end (завершение) обозначает, что LC не должны больше нигде
  * далее использоваться в функции. Эта операция не нужна для большинства
  * реализаций LC, но в некоторых случаях она нужна.
  *
  * \hideinitializer
  */
 #define LC_END(lc)
 
 /**
  * \var typedef lc_t;
  *
  * Тип для LC.
  *
  * \hideinitializer
  */
 #endif /* DOXYGEN */
 
 #ifndef __LC_H__
 #define __LC_H__
 
 #ifdef LC_CONF_INCLUDE
 #include LC_CONF_INCLUDE
 #else
 #include "lc-switch.h"
 #endif /* LC_CONF_INCLUDE */
 
 #endif /* __LC_H__ */
 
 /** @} */
 /** @} */
