//----------------------------------------------------------------------------//
#include "common_types.h"
//----------------------------------------------------------------------------//
#define MD5_STR_LEN	16
//----------------------------------------------------------------------------//
void MD5Init(void);
void MD5Update(char *input, u32 inputlen);
void MD5Final(char digest[MD5_STR_LEN]);
void MD5_ToHexStr(char* MD5_char, char* MD5_str);	//Преобразование MD5 в строку
//----------------------------------------------------------------------------//
