//----------------------------------------------------------------------------//
#ifndef INCUTILS_H
#define INCUTILS_H
//----------------------------------------------------------------------------//
#include <stdio.h>
#include "common_types.h"
#include "cmt453x.h"
//----------------------------------------------------------------------------//
void SupplyEn(void);		//Включение питания
//----------------------------------------------------------------------------//
void SystemClock_Config(void);	//Настройка тактирования
void Init_Core(void);			//Инициализация основных модулей 
void IWDG_Refresh(void);		//Сброс IWDG
//----------------------------------------------------------------------------//
#endif
//----------------------------------------------------------------------------//
